{
    "frontend_developer":"Développeur Front-End React.js",
    "contact":"Contact",
    "about":"À propos",
    "welcome_portfolio": "Bienvenue sur mon portfolio !",
    "take_a_look": "Jetez un œil à mes projets ou contactez moi",
    "projects":"Projets",
    "aboutme": "À propos de moi",
    "age":"Rayan Dahmena, {{age}} ans",
    "formation": "J'ai suivi la formation de développeur Front-End d'OpenClassrooms. Mon objectif est d'obtenir un poste de développeur Front-End React.js.",
    "portfolio_projects":"Ce portfolio est accompagné de plusieurs projets professionnalisants, ainsi que d'autres fonctionnalités.",
    "frontend_stack":"Stack Front-End",
    "backend_stack":"Stack Back-End",
    "other_stack":"... et autres",
    "my_projects":"Mes projets",
    "search_project":"Rechercher un projet",
    "filter":"Filtrer",
    "hrnet":"Convertir une application jQuery en React",
    "argentbank":"Utiliser une API pour un compte utilisateur bancaire avec React",
    "sportsee":"Développer un tableau de bord d'analytics avec React",
    "kasa":"Développer une application avec React et React Router",
    "billed":"Débugger et tester un SaaS RH",
    "lespetitsplats":"Développer un algorithme de recherche en Javascript",
    "fisheye":"Créer un site accessible pour une plateforme de photographes",
    "gameon":"Créer une landing page avec Javascript",
    "ohmyfood":"Dynamiser une page web avec des animations CSS",
    "reservia":"Transformer une maquette en site web avec HTML & CSS",
    "several_projects": "{{length}} projets correspondent à votre recherche",
    "one_project": "{{length}} projet correspond à votre recherche",
    "no_project": "Aucun projet ne correspond à votre recherche",
    "light_theme":"Thème clair",
    "dark_theme":"Thème sombre",
    "language":"Langue",
    "hrnet0":"Le site HRNet React permet aux utilisateurs d'ajouter des employés depuis un formulaire, ces derniers sont visibles dans la page d'employés, qui range les employés par de multiples champs.",
    "hrnet1":"Ce site, au départ développé en jQuery, a été entièrement converti en React pour améliorer les performances.",
    "hrnet2":"Plusiers paquets NPM sont installés dont mon propre paquet modale disponible en dessous.",
    "hrnet3":"Redux est utilisé pour gérer l'état du site.",
    "hrnet_link_0":"Paquet NPM de la modale React",
    "hrnet_link_1":"Lien du dépôt github du projet en jQuery",
    "argentbank0":"Ce site permet aux utilisateurs de se connecter et d'accéder à leur profil.",
    "argentbank1":"L'utilisateur peut voir et modifier ses informations qui seront conservés dans la base de données MongoDB.",
    "argentbank2":"Redux est utilisé pour gérer l'état du site.",
    "argentbank3":"Des appels API sont effectués avec Axios pour obtenir les données.",
    "argentbank4":"Plus d'informations en dessous.",
    "argentbank_link_0":"Lien du dépôt github du projet Backend",
    "sportsee0":"Sportsee vous permet de visiter le profil de deux utilisateurs, vous pouvez voir leurs performances à travers des graphiques.",
    "sportsee1":"Ce projet utilise la librairie Recharts pour produire des graphiques.",
    "sportsee2":"Des appels API sont effectués avec Axios pour obtenir les données",
    "sportsee3":"Plus d'informations en dessous.",
    "sportsee_link_0":"Lien du dépôt github du projet Backend",
    "kasa0":"Kasa est un site d'annonces de logements.",
    "kasa1":"Chaque logement a sa page, vous pouvez naviguer à travers les images du logement.",
    "kasa_link_0":"Lien du dépôt github du projet Backend",
    "billed0":"Billed est un site pour ajouter des notes de frais aux employés.",
    "billed1":"Les objectifs de ce projets sont de corriger les bugs avec le débogueur de Chrome et de rédiger des tests unitaires.",
    "billed_link_0":"Lien du dépôt github du projet Backend",
    "lespetitsplats0":"Ce site affiche les recettes que vous pouvez filtrer par la barre de recherche ou par de simples filtres.",
    "lespetitsplats1":"Le dépôt github contient les branches algo1 et algo2.",
    "lespetitsplats2":"La branche Algo1 filtre les tableaux avec la méthode de l'objet tableau.",
    "lespetitsplats3":"La branche Algo2 filtre les tableaux avec les boucles natives de Javascript",
    "lespetitsplats4":"Plus d'informations sur la branche main, fiche_investigation.pdf",
    "lespetitsplats_link_0":"Fiche d'investigation",
    "fisheye0":"La page principale affiche les photographes que vous pouvez filtrer par des tags.",
    "fisheye1":"Vous pouvez accéder à la page des photographes avec leurs images.",
    "fisheye2":"Navigation à travers les images avec le carousel.",
    "fisheye3":"Vous pouvez aimer un média pour incrémenter le nombre total de 'j'aime'.",
    "fisheye4":"Ouvrez un formulaire pour contacter le photographe, un envoi réussi affichera le résultat dans la console",
    "fisheye5":"NB : il n'y a aucun serveur en ligne, aucune donnée ne sera envoyée, il s'agit juste d'une simulation d'un formulaire",
    "gameon0":"Ouvrez un formulaire et inscrivez vous sur GameOn.",
    "gameon1":"NB : il n'y a aucun serveur en ligne, aucune donnée ne sera envoyée, il s'agit juste d'une simulation d'un formulaire",
    "ohmyfood0":"OhMyFood est un site de restaurants, séléctionnez un restaurant et un plat.",
    "ohmyfood1":"L'apparition des plats est dynamisé par des animations CSS, avec SASS.",
    "reservia0":"Reservia est un site de réservation de vacances.",
    "reservia1":"NB : ce site n'a aucune fonctionnalité, il s'agit juste d'une intégration de maquette en HTML, CSS.",
    "github_repo_link":"Lien du dépôt github",
    "website_link":"Lien du site",
    "responsive":"Site réactif",
    "next_project":"Projet suivant",
    "previous_project":"Projet précédent",
    "error":"Erreur",
    "doesnt_exist":"Cette page n'existe pas.",
    "home_page":"Page d'accueil" 
}