{
    "frontend_developer":"Développeur Fullstack",
    "contact":"Contact",
    "about":"À propos",
    "welcome_portfolio": "Bienvenue sur mon portfolio !",
    "take_a_look": "Jetez un œil à mes projets ou contactez moi",
    "projects":"Projets",
    "aboutme": "À propos de moi",
    "age":"Rayan Dahmena, {{age}} ans",
    "formation": "J'ai suivi la formation de développeur Front-End d'OpenClassrooms. Mon objectif est d'obtenir une alternance ou un CDI dans un poste de développeur fullstack en entreprise.",
    "portfolio_projects":"Ce portfolio est accompagné de plusieurs projets, ainsi que d'autres fonctionnalités.",
    "frontend_stack":"Stack Front-End",
    "backend_stack":"Stack Back-End",
    "other_stack":"... et autres",
    "my_projects":"Mes projets",
    "search_project":"Rechercher un projet",
    "filter":"Filtrer",
    "your_car_your_way":"Définir une solution fonctionnelle et concevoir l'architecture d'une application",
    "maison_en_place":"Planifier des tests, de la surveillance et des backups",
    "catasterre":"Former et encadrer une équipe de développement fullstack",
    "bobapp":"Gérer un projet collaboratif en intégrant une démarche CI/CD",
    "delivery_fit":"Valider, chiffrer et cadrer un projet",
    "livrai":"Réaliser un cahier des charges fonctionnel et technique pour une application",
    "monde_de_dev":"Développer une application full-stack complete",
    "yoga-app":"Tester une application full-stack",
    "knesh":"Définir les technologies et les paradigmes d'une application",
    "chatop":"Développer le back-end en utilisant Java et Spring",
    "olympic_games":"Développer le front-end en utilisant Angular",
    "hrnet":"Convertir une application jQuery en React",
    "argentbank":"Utiliser une API pour un compte utilisateur bancaire avec React",
    "sportsee":"Développer un tableau de bord d'analytics avec React",
    "kasa":"Développer une application avec React et React Router",
    "learn_at_home":"Définir les besoins pour une application de soutien scolaire",
    "billed":"Débugger et tester un SaaS RH",
    "lespetitsplats":"Développer un algorithme de recherche en Javascript",
    "fisheye":"Créer un site accessible pour une plateforme de photographes",
    "gameon":"Créer une landing page avec Javascript",
    "ohmyfood":"Dynamiser une page web avec des animations CSS",
    "reservia":"Transformer une maquette en site web avec HTML & CSS",
    "several_projects": "{{length}} projets correspondent à votre recherche",
    "one_project": "{{length}} projet correspond à votre recherche",
    "no_project": "Aucun projet ne correspond à votre recherche",
    "light_theme":"Thème clair",
    "dark_theme":"Thème sombre",
    "language":"Langue",
    "your_car_your_way0":"Your Car Your Way est une application de location de véhicules qui présente des problèmes majeurs (voir contexte dans documents), ce qui va amener à refaire le projet en définissant une solution fonctionnelle et en concevant son architecture.",
    "your_car_your_way1":"Le document Business Requirements met en avant les fonctionnalités à implémenter (authentification, location de vehicules, contact avec le service client) et exigences particulières.",
    "your_car_your_way2":"Le document Architecture Definition Document évoque les principes d'architecture, les illustrent sous forme de diagrammes de composants, de déploiement ainsi que d'un modèle de données.",
    "your_car_your_way3":"Le document Compliance Assessment est une évaluation de conformité, vous y trouverez les listes de contrôle permettant de vérifier que l'implémentation respecte bien le dossier de défintion d'architecture.",
    "your_car_your_way4":"Une preuve de concept (PoC, Proof of Concept) est également développée dans ce projet, celle-ci s'assure de la faisabilité de la fonctionnalité d'échange entre un client et le service client via un chat en temps réel (utilisation de Websockets).",
    "your_car_your_way5":"Consultez le dépôt github de ce projet pour essayer la preuve de concept, vous pouvez aussi vous procurer les documents cités précédemment.",
    "maison_en_place0":"Comme la description l'indique, ce projet a pour but de planifier des tests, de la surveillance et des backups (sauvegardes).",
    "maison_en_place1":"Le plan de test définit le contexte et les scénarios de test de toutes les fonctionnalités importantes en suivant les principes de Behavior-Driven Development (BDD).",
    "maison_en_place2":"Le plan de sécurité identifie les risques, définit les solutions face à ces risques et liste les outils pour s'en prémunir.",
    "maison_en_place3":"Le plan de sauvegarde des données définit les besoins, trouve une solution correspondante et définit un plan de restauration des données.",
    "maison_en_place4":"Consultez le dépôt github de ce projet pour récupérer les documents.",
    "catasterre0":"L'objectif est de définir la répartition des tâches au sein d'une équipe, planifier le projet en utilisant une méthodologie agile, superviser l'exécution du projet par l'équipe de développement, adresser les besoins de compétences de l'équipe technique avec un plan de formation et assurer le respect des normes de qualité ITIL et des droits RGPD.",
    "catasterre1":"Le Sprint Backlog désigne des tâches sélectionées pour effectuer un sprint.",
    "catasterre2":"Vous trouverez également un document prouvant le bon respect des normes RGPD et des bonnes pratiques ITIL.",
    "catasterre3":"Le plan d'action liste 3 idées pour améliorer la coopération au quotidien, expliquant l'impact positif que chacune de ces initiatives apportent à l'équipe, il comprend aussi une liste comparative entre les compétences de l'équipe et les besoins liés au projet. Vous trouverez également une liste de formations à proposer pour faire monter en compétences l'équipe sur ses points faibles.",
    "catasterre4":"Ce projet contient aussi une fiche de poste pour recruter un responsable qualité.",
    "catasterre5":"Consultez le dépôt github de ce projet pour récupérer les documents.",
    "bobapp0":"Ce projet a pour but de mettre en place des workflows en suivant la démarche Intégration Continue/Livraison Continue avec Github Actions.",
    "bobapp1":"La CI/CD lance les tests, vérifie la qualité du code, build le projet, crée les images Docker, automatise la génération des rapports de couverture des tests et déploie les conteneurs sur Docker Hub",
    "bobapp2":"SonarQube est utilisé pour évaluer la qualité du code écrit.",
    "bobapp3":"Consultez le dépôt github de ce projet pour voir la pipeline CI/CD ainsi que le document explicatif dans lequel vous trouverez une analyse des métriques obtenues.",
    "delivery_fit0":"L'objectif est d'estimer la faisabilité d'un projet sous forme de proposition commerciale.",
    "delivery_fit1":"Cette proposition commerciale contient la charge de travail nécessaire pour la réalisation de l'application, les coûts basés sur les ressources humaines mises à disposition, les risques potentiels associés au projet ainsi que des objectifs de performance.",
    "delivery_fit2":"Consultez le dépôt github de ce projet pour voir le contexte ainsi que la proposition commerciale.",
    "livrai0":"L'objectif de ce projet est de réaliser un audit d'une application existante ainsi qu'un cahier des charges pour une nouvelle version de l'application.",
    "livrai1":"L'audit comprend une description des fonctionnalités accompagnée de schémas fonctionnels pour chaque type d'utilisateur, une description technique accompagnée d'un schéma de l'architecture de l'application existante. On retrouve également des points forts et des déficiences.",
    "livrai2":"Le cahier des charges détaille les spécifications fonctionnelles et techniques de la future application.",
    "livrai3":"Consultez le dépôt github pour voir les documents.",
    "livrai_link_0":"Lien de l'application existante servant à la réalisation de l'audit",
    "monde_de_dev0":"Monde de Dév est une application pour développeurs, ceux-ci peuvent s'authentifier, s'abonner à un thème et publier un article lié à un theme.",
    "monde_de_dev1":"Les utilisateurs peuvent également commenter un article publié et mettre à jour leurs profils.",
    "monde_de_dev2":"Consultez le dépôt github de ce projet pour le lancer.",
    "yoga-app0":"L'objectif de ce projet est de rédiger des tests unitaires, d'intégration et de bout-en-bout.",
    "yoga-app1":"Les tests côté front sont écrits avec Jest et Cypress.",
    "yoga-app2":"Les tests côté back sont écrits avec JUnit, Mockito et MockMVC",
    "knesh0":"Ce projet à pour but de définir les technologies et les paradigmes d'une application selon des besoins définis.",
    "knesh1":"Consultez le dépôt github pour voir les besoins et les solutions proposées.",
    "chatop0":"ChaTôp est une application de location de logements.",
    "chatop1":"Cette application a été développée avec Angular et Spring Boot.",
    "chatop2":"Spring Security est utilisé pour sécuriser l'application et gérer les authentifications et autorisations.",
    "chatop3":"Consultez le README dans le dépôt github pour lancer le projet.",
    "chatop_link_0":"Lien du projet front-end Angular",
    "olympic_games0":"Olympic Games permet de visualiser le nombre de médailles olympiques de cinq pays durant les trois dernières éditions des jeux olympiques.",
    "olympic_games1":"Ce projet a été réalisé avec Angular et la librairie ngx-charts pour les graphiques.",
    "olympic_games2":"Consultez le README dans le dépôt github pour lancer le projet.",
    "hrnet0":"Le site HRNet React permet aux utilisateurs d'ajouter des employés depuis un formulaire, ces derniers sont visibles dans la page d'employés, qui range les employés par de multiples champs.",
    "hrnet1":"Ce site, au départ développé en jQuery, a été entièrement converti en React pour améliorer les performances.",
    "hrnet2":"Plusiers paquets NPM sont installés dont mon propre paquet modale disponible en dessous.",
    "hrnet3":"Redux est utilisé pour gérer l'état du site.",
    "hrnet_link_0":"Paquet NPM de la modale React",
    "hrnet_link_1":"Lien du dépôt github du projet en jQuery",
    "argentbank0":"Ce site permet aux utilisateurs de se connecter et d'accéder à leur profil.",
    "argentbank1":"L'utilisateur peut voir et modifier ses informations qui seront conservés dans la base de données MongoDB.",
    "argentbank2":"Redux est utilisé pour gérer l'état du site.",
    "argentbank3":"Des appels API sont effectués avec Axios pour obtenir les données.",
    "argentbank4":"Plus d'informations en dessous.",
    "argentbank_link_0":"Lien du dépôt github du projet Backend",
    "sportsee0":"Sportsee vous permet de visiter le profil de deux utilisateurs, vous pouvez voir leurs performances à travers des graphiques.",
    "sportsee1":"Ce projet utilise la librairie Recharts pour produire des graphiques.",
    "sportsee2":"Des appels API sont effectués avec Axios pour obtenir les données",
    "sportsee3":"Plus d'informations en dessous.",
    "sportsee_link_0":"Lien du dépôt github du projet Backend",
    "kasa0":"Kasa est un site d'annonces de logements.",
    "kasa1":"Chaque logement a sa page, vous pouvez naviguer à travers les images du logement.",
    "kasa_link_0":"Lien du dépôt github du projet Backend",
    "learn_at_home0":"Ce projet à pour objectif de définir les besoins d'une application de soutien scolaire.",
    "learn_at_home1":"Les documents de ce projet sont accessibles dans le dépôt Github.",
    "learn_at_home2":"Des diagrammes de cas d'usage illustrent les interactions entre les acteurs et les fonctionnalités des différentes pages.",
    "learn_at_home3":"Un document pour les récits utilisateurs avec critères d'acceptation détaillent les fonctionnalités définies.",
    "learn_at_home4":"Les maquettes sont adaptées aux formats ordinateur et mobile pour chaque page du projet. Les maquettes ont été produites depuis Figma.",
    "learn_at_home5":"Un tableau kanban pour évoluer en méthodologie agile est disponible en dessous. Ce tableau regroupe les fonctionnalités du projet.",
    "learn_at_home_link_0":"Lien des diagrammes de cas d'usage",
    "learn_at_home_link_1":"Lien des récits utilisateurs avec critère d'acceptation",
    "learn_at_home_link_2":"Lien des maquettes",
    "learn_at_home_link_3":"Lien du tableau kanban",
    "billed0":"Billed est un site pour ajouter des notes de frais aux employés.",
    "billed1":"Les objectifs de ce projets sont de corriger les bugs avec le débogueur de Chrome et de rédiger des tests unitaires.",
    "billed_link_0":"Lien du dépôt github du projet Backend",
    "lespetitsplats0":"Ce site affiche les recettes que vous pouvez filtrer par la barre de recherche ou par de simples filtres.",
    "lespetitsplats1":"Le dépôt github contient les branches algo1 et algo2.",
    "lespetitsplats2":"La branche Algo1 filtre les tableaux avec la méthode de l'objet tableau.",
    "lespetitsplats3":"La branche Algo2 filtre les tableaux avec les boucles natives de Javascript",
    "lespetitsplats4":"Plus d'informations sur la branche main, fiche_investigation.pdf",
    "lespetitsplats_link_0":"Fiche d'investigation",
    "fisheye0":"La page principale affiche les photographes que vous pouvez filtrer par des tags.",
    "fisheye1":"Vous pouvez accéder à la page des photographes avec leurs images.",
    "fisheye2":"Navigation à travers les images avec le carousel.",
    "fisheye3":"Vous pouvez aimer un média pour incrémenter le nombre total de 'j'aime'.",
    "fisheye4":"Ouvrez un formulaire pour contacter le photographe, un envoi réussi affichera le résultat dans la console",
    "fisheye5":"NB : il n'y a aucun serveur en ligne, aucune donnée ne sera envoyée, il s'agit juste d'une simulation d'un formulaire",
    "gameon0":"Ouvrez un formulaire et inscrivez vous sur GameOn.",
    "gameon1":"NB : il n'y a aucun serveur en ligne, aucune donnée ne sera envoyée, il s'agit juste d'une simulation d'un formulaire",
    "ohmyfood0":"OhMyFood est un site de restaurants, séléctionnez un restaurant et un plat.",
    "ohmyfood1":"L'apparition des plats est dynamisé par des animations CSS, avec SASS.",
    "reservia0":"Reservia est un site de réservation de vacances.",
    "reservia1":"NB : ce site n'a aucune fonctionnalité, il s'agit juste d'une intégration de maquette en HTML, CSS.",
    "github_repo_link":"Lien du dépôt github",
    "website_link":"Lien du site",
    "responsive":"Site réactif",
    "next_project":"Projet suivant",
    "previous_project":"Projet précédent",
    "error":"Erreur",
    "doesnt_exist":"Cette page n'existe pas.",
    "home_page":"Page d'accueil",
    "open_image":"Ouvrir cette image dans un nouvel onglet",
    "tooltipText":"Inscrivez vous afin de me contacter, aucune donnée ne sera partagée.",
    "login":"Connexion",
    "register":"Inscription",
    "email":"Email",
    "password":"Mot de passe",
    "username":"Nom d'utilisateur",
    "create_password":"Créer mot de passe",
    "confirm_password":"Confirmer mot de passe",
    "remember":"Se souvenir de moi",
    "forgot":"Mot de passe oublié ?",
    "field_miss":"Remplissez tous les champs.",
    "invalid_username":"Entrez un nom d'utilisateur valide, au moins 3 caractères.",
    "invalid_email":"Entrez une adresse email valide.",
    "password_length":"Le mot de passe doit faire au moins 6 caractères.",
    "different_passwords":"Les mots de passe sont différents.",
    "account_exists":"Cette adresse email est déjà utilisée.",
    "existing_username":"Ce nom d'utilisateur est déjà utilisé.",
    "all_fields_miss":"Remplissez tous les champs.",
    "email_miss":"Saisissez l'adresse email.",
    "password_miss":"Saisissez le mot de passe.",
    "unknown_email":"Adresse email inconnue.",
    "incorrect_password":"Mot de passe incorrect.",
    "server_error":"Erreur du serveur.",
    "show_password":"Montrer le mot de passe",
    "bcrypt":"Authentification sécurisée par",
    "invalid_token":"Erreur, jeton invalide.",
    "encrypy_password_error":"Erreur, impossible de crypter le mot de passe.",
    "password_reset":"Mot de passe réinitialisé avec succès.",
    "email_sent":"Un mail a été envoyé à votre adresse pour réinitialiser votre mot de passe.",
    "password_changed":"Mot de passe modifié avec succès.",
    "current_password_incorrect":"Mot de passe actuel incorrect.",
    "send_email":"Entrez votre adresse email pour réinitialiser votre mot de passe",
    "send":"Envoyer",
    "password_confirm_miss":"Entrez la confirmation du mot de passe",
    "reset_password":"Réinitialiser le mot de passe",
    "choose_new_password":"Choisir nouveau mot de passe",
    "new_password":"Nouveau mot de passe",
    "confirm_new_password":"Confirmer le nouveau mot de passe",
    "change":"Changer",
    "navigate_profile":"Accès au profil",
    "invalid_link":"Lien invalide ou a expiré, désolé.",
    "welcome_username":"Bienvenue {{username}} !",
    "logout":"Déconnexion",
    "logout_confirmation":"Voulez-vous vous déconnecter ?",
    "last_login":"Dernière connexion",
    "settings":"Réglages",
    "edit_password":"Modifier le mot de passe",
    "edit":"Modifier",
    "cancel":"Annuler",
    "current_password":"Mot de passe actuel",
    "enter_message":"Entrez un message",
    "last_conversations":"Dernières conversations",
    "last_messages":"Derniers messages",
    "no_message_yet":"Aucun message pour le moment",
    "start_new_conversation":"Démarrez une conversation",
    "new_conversation":"Nouvelle conversation",
    "follow_conversation":"Suivre ma conversation",
    "conversation_welcome":"Bienvenue sur la page de conversation privée !",
    "conversation_send":"Envoyez à {{adminUser}} un premier message.",
    "about_text":"Ce site a été codé en React, Node.js, Express. MongoDB est utilisée comme base de données. D'autres dépendances sont utilisées pour le développement de ce site. Pour plus d'informations, voir ci-dessous le dépôt github de ce portfolio.",
    "github_link":"Dépôt github",
    "conversation":"Conversation",
    "error_404":"Erreur",
    "profile":"Profil",
    "chat":"Conversation",
    "enter_email":"Entrez une adresse email",
    "enter_name":"Entrez un nom",
    "name":"Nom",
    "invalid_name":"Entrez un nom valide, au moins 3 caractères",
    "invalid_message":"Entrez un message d'au moins 10 caractères",
    "message_sent":"Message envoyé",
    "contact_message":"Envoyez un message simple ou discutez en temps réel.",
    "message":"Message",
    "send_simple_message":"Envoyez un message simple",
    "you":"Vous"         
}